# Задайте последовательность чисел.Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.

numbers = [1, 1, 2, 2, 3, 3, 4, 5, 1, 546, 41, 555, 555, 555, 555, 1]
print(set(numbers))

